[
    [
        "../../assets/image/characters/Hutao/Constellation/constellation_1.png",
        "Алый букет",
        [
            [0, ["Заряженные атаки Ху Тао перестают потреблять выносливость в состоянии Танец бабочки навыка Путеводитель по загробной жизни."]]
        ]
    ],
    [
        "../../assets/image/characters/Hutao/Constellation/constellation_2.png",
        "Зловещий дождь",
        [
            [0, ["Увеличивает урон Кровавого цветка на 10% от макс. HP Ху Тао на момент наложения эффекта. Упокоение духов также накладывает эффект Кровавого цветка."]]
        ]
    ],
    [
        "../../assets/image/characters/Hutao/Constellation/constellation_3.png",
        "Плавный кармин",
        [
            [0, ["Увеличивает уровень навыка Путеводитель по загробной жизни на 3.", "Макс. уровень: 15"]]
        ]
    ],
    [
        "../../assets/image/characters/Hutao/Constellation/constellation_4.png",
        "Сады вечного покоя",
        [
            [0, ["После победы над противником, находящимся под эффектом Кровавого цветка, наложенным самой Ху Тао, шанс крит. попадания всех окружающих членов отряда (кроме самой Ху Тао) увеличивается на 12% в течение 15 сек."]]
        ]
    ],
    [
        "../../assets/image/characters/Hutao/Constellation/constellation_5.png",
        "Цветочные благовония",
        [
            [0, ["Увеличивает уровень навыка Упокоение духов на 3.", "Макс. уровень: 15"]]
        ]
    ],
    [
        "../../assets/image/characters/Hutao/Constellation/constellation_6.png",
        "Объятья бабочки",
        [
            [0, ["Активируется, когда HP Ху Тао опускается ниже 25% или когда она получает летальный урон:"]],
            [3, ["Ху Тао не погибает от полученного урона. Напротив, на следующие 10 сек. все её элементальные сопротивления и физическое сопротивление повышаются на 200%, её шанс крит. попадания увеличивается на 100%, а также сильно повышается её сопротивление к прерыванию.", "Этот эффект активируется автоматически, когда у Ху Тао остаётся 1 HP.", "Может возникнуть раз в 60 сек."]]
        ]
    ]
]

[
    ["../../assets/image/characters/hy/Constellation/constellation_1.png", 
    "dsf", 
    [0, ["gfnghmghmm"]]
    ], 
    ["", "", [0, ""]], 
    ["", "", [0, ""]], 
    ["", "", [0, ""]], 
    ["", "", [0, ""]], 
    ["", "", [0, ""]]
]

[
    [
        "",
        "",
        [
            [0, []]
        ]
    ],
    [
        "",
        "",
        [
            [0, []]
        ]
    ],
    [
        "",
        "",
        [
            [0, []]
        ]
    ],
    [
        "",
        "",
        [
            [0, []]
        ]
    ],
    [
        "",
        "",
        [
            [0, []]
        ]
    ],
    [
        "",
        "",
        [
            [0, []]
        ]
    ]
]