[
    [
        ["Скрытое копьё «Ваншэн»"], 
        [
            [1, "Обычная атака:", ["До шести ударов копьём."]], 
            [1, "Заряженная атака:", ["Выпад, наносящий урон противникам на пути, на который тратится определённое количество выносливости."]], 
            [1, "Атака в падении:", ["Стремительно падает на землю, атакуя всех врагов на пути. Приземлившись, наносит урон по площади."]]
        ]
    ], 
    [
        ["Путеводитель по загробной жизни", "элементальный навык"], 
        [
            [0, ["Лишь непоколебимое пламя может очистить этот мир.", "Ху Тао потребляет определённое количество HP, откидывает окружающих её противников и входит в состояние Танец бабочки."]], 
            [2, "Танец бабочки:", ["Сила атаки Ху Тао в этом состоянии увеличивается в зависимости от её макс. HP. Полученный таким образом бонус силы атаки не может превышать 400% от базовой силы атаки Ху Тао.", "Конвертирует урон от атак в Пиро урон, этот эффект не может быть отменён какой-либо элементальной инфузией.", "Заряженные атаки накладывают на врагов эффект Кровавого цветка.", "Повышает сопротивление Ху Тао к прерыванию."]], 
            [1, "Кровавый цветок:", ["Противники с эффектом Кровавого цветка будут получать Пиро урон каждые 4 сек., который считается уроном элементального навыка.", "Каждый противник может иметь только один эффект Кровавого цветка, и его длительность может быть обновлена только самой Ху Тао."]], 
            [0, ["Танец бабочки заканчивается, если истёк срок действия, Ху Тао покинула поле боя или повержена."]]
        ], 
        "Техника скрытого копья Ху Тао основывается на нескольких правилах, первое из которых гласит: «На тот свет дорогу открывает копьё, идут вслед за бабочками умерших души»."
    ], 
    [
        ["Упокоение духов", "взрыв стихии"],
        [
            [0, ["Приказывает пылающему духу атаковать, нанося Пиро урон по большой площади.", "При попадании по врагу восстанавливает некоторый процент макс. HP Ху Тао. Этот эффект может активироваться до 5 раз, в зависимости от количества задетых противников.", "Если HP Ху Тао равно или ниже 50% в момент попадания по противнику, наносимый урон и количество восстановленного HP увеличиваются."]]
        ],
        "Сверхъестественная активность тех, кто уже покинул этот мир, является источником больших переживаний в похоронном бюро «Ваншэн». В подобных случаях кремация всегда помогает Ху Тао обрести душевный покой. Чем больше она тревожится, тем сильнее пламя."
    ], 
    [
        ["Порхай как бабочка", "пассивный талант", "разблокируется на 1 уровне возвышения"],
        [
            [0, ["После окончания состояния Танец бабочки навыка Путеводитель по загробной жизни шанс крит. попадания всех членов отряда (кроме самой Ху Тао) увеличивается на 12% в течение 8 сек."]]
        ]
    ], 
    [
        ["Кровавая сангина", "пассивный талант", "разблокируется на 4 уровне возвышения"],
        [
            [0, ["Увеличивает бонус Пиро урона Ху Тао на 33%, когда её HP меньше или равно 50%."]]
        ]
    ], 
    [
        ["Чем больше, тем лучше", "пассивный талант", "разблокируется автоматически"],
        [
            [0, ["При приготовлении идеального блюда имеет 18% шанс приготовить дополнительное «странное» блюдо того же типа."]]
        ]
    ]
]